Revit 2027 API
DockablePane.Id Property
 The unique identifier for this dockable pane.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DockablePaneId Id { get; }
Public ReadOnly Property Id As DockablePaneId
	Get
public:
property DockablePaneId^ Id {
	DockablePaneId^ get ();
}
member Id : DockablePaneId with get
Property Value
DockablePaneId
See Also
Reference
DockablePane Class
Autodesk.Revit.UI Namespace